app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2021-03-08 04:47:37.926761"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id]) #queries db for article and stores it as an instance var
    @article.update(title: params[:article][:title], description: params[:article][:description]) #updates values from the form and saves changes